#!/usr/bin/python3
# -*- coding: utf-8 -*-
import datetime

lottery_code_map = {
    '10017': '2009',    # 安徽11选5
    '10006': '2002',    # 广东11选5
    '10022': '2013',    # 广西11选5
    '10020': '2012',    # 湖北11选5
    '10023': '2014',    # 吉林11选5
    '10016': '2008',    # 江苏11选5
    '10015': '2007',    # 江西11选5
    '10019': '2011',    # 辽宁11选5
    '10024': '2015',    # 内蒙古11选5
    '10018': '2010',    # 上海11选5
    '10025': '2106',    # 浙江11选5

    '10030': '2020',    # 安徽快3
    '10033': '2023',    # 北京快3
    '10031': '2021',    # 福建快3
    '10063': '2027',    # 甘肃快3
    '10026': '2016',    # 广西快3
    '10062': '2026',    # 贵州快3
    '10028': '2018',    # 河北快3
    '10032': '2022',    # 湖北快3
    '10027': '2017',    # 吉林快3
    '10007': '2003',    # 江苏快3
    '10029': '2019',    # 内蒙古快3
    '10061': '2025',    # 上海快3

    '10003': '5008',    # 天津时时彩
    '10004': '5009',    # 新疆时时彩

    '10034': '2024',    # 天津快乐十分
    '10038': '5010',    # 广西快乐十分
    '10005': '2001',    # 广东快乐十分

    '10009': '2005',    # 重庆快乐农场
    '10008': '2004',    # 十一运夺金
    '10014': '2006',    # 北京快乐8
    '10001': '5001',    # 北京pk10
}

# 购彩计划 & 杀号计划
buy_plan_lot_code_map = {
    '10058': '5005',    # SG飞艇
    '10001': '5001',    # 北京PK10
    '10037': '1001',    # 极速赛车
    '10012': '3003',    # 澳洲幸运十
    '10035': '1003',    # 急速飞艇
    '10060': '5002',    # 重庆欢乐生肖
    '10059': '5003',    # 幸运时时彩
    '10003': '5008',    # 天津时时彩
    '10064': '5007',    # 台湾5分彩
    '10004': '5009',    # 新疆时时彩
    '10036': '1002',    # 极速时时彩
    '10010': '3001',    # 澳洲幸运5
    '10006': '2002',    # 广东11选5
    '10025': '2106',    # 浙江11选5
    '10015': '2007',    # 江西11选5
    '10016': '2008',    # 江苏11选5
    '10017': '2009',    # 安徽11选5
    '10018': '2010',    # 上海11选5
    '10019': '2011',    # 辽宁11选5
    '10020': '2012',    # 湖北11选5
    '10022': '2013',    # 广西11选5
    '10023': '2014',    # 吉林11选5
    '10024': '2015',    # 内蒙古11选5
    '10008': '2004',    # 十一运夺金
    '10007': '2003',    # 江苏快3
    '10026': '2016',    # 广西快3
    '10027': '2017',    # 吉林快3
    '10028': '2018',    # 河北快3
    '10029': '2019',    # 内蒙古快3
    '10030': '2020',    # 安徽快3
    '10031': '2021',    # 福建快3
    '10032': '2022',    # 湖北快3
    '10033': '2023',    # 北京快3
    '10061': '2025',    # 上海快3
    '10062': '2026',    # 贵州快3
    '10063': '2027',    # 甘肃快3
    '10046': '5011',    # PC蛋蛋幸运28
    '10005': '2001',    # 广东快乐十分
    '10034': '2024',    # 天津快乐十分
    '10011': '3002',    # 澳洲幸运8
    '10009': '2005',    # 重庆幸运农场
}

# 专家id
user_ids_sgft = [
    # SG飞艇
    '143',  # 骆驼瘦死
    '144',  # 霸主
    '160',  # 瞭望哨
    '142',  # 人上有人
    '152',  # 国王陛下
    '150',  # 力图自强
    '149',  # 雷霆
    '148',  # 龙头老大
    '151',  # 老藤
    '154',  # 人为财死
    '157',  # 势如破竹
    '158',  # 零位
    '147',  # 胜者
    '155',  # 任我行
    '159',  # 爱我所爱
    '153',  # 蝼蚁
    '156',  # 力挽狂澜
    '145',  # 钟馗
    '146',  # 夜空
    '141',  # 梁书文
]

user_ids_bj_pk10 = [
    # 北京PK10
    '18',  # 能人
    '9',  # 烂泥
    '13',  # 日理万机
    '1',  # 断水流
    '15',  # 如你所愿
    '4',  # 令人满意
    '7',  # 阿鲁提亚
    '8',  # 了如指掌
    '17',  # 柳暗花明
    '12',  # 陆离
    '2',  # 能耐我何
    '5',  # 恶狼传说
    '19',  # 老农
    '14',  # 难能可贵
    '11',  # 一个老人
    '20',  # 念念不忘
    '3',  # 老老实实
    '10',  # 阿牛哥
    '6',  # 老娘
    '16',  # 爱理不理
]

user_ids_jssc = [
    # 急速赛车
    '134',  # 鹿死我手
    '138',  # 络腮胡
    '129',  # 龙三
    '124',  # 刘沁
    '136',  # 料事如神
    '121',  # 牛脾气
    '133',  # 逆时针
    '131',  # 屡试不爽
    '126',  # 宁缺
    '128',  # 能掐会算
    '123',  # 鸟枪换炮
    '139',  # 蓝舌
    '122',  # 老彭
    '135',  # 略胜一筹
    '127',  # 老前辈
    '140',  # 罗斯
    '137',  # 睨视
    '132',  # 人上人
    '130',  # 连胜
    '125',  # 人穷志短
]

user_ids_az_xy10 = [
    # 澳洲幸运10
    '49',  # 认不出
    '55',  # 爱财如命
    '46',  # 吕不韦
    '58',  # 任重道远
    '42',  # 难不倒
    '57',  # 良辰吉日
    '43',  # 蜡笔小新
    '54',  # 屡战屡败
    '47',  # 刘伯温
    '48',  # 奥布莱恩
    '51',  # 陆冰
    '44',  # 耳边风
    '60',  # 落尘
    '41',  # 惹不起
    '50',  # 鲁班
    '56',  # 老粗
    '53',  # 力薄才疏
    '59',  # 嫩草
    '45',  # 老表
    '52',  # 肉白骨
]

user_ids_jsft = [
    # 急速飞艇
    '107',  # 扭亏为盈
    '117',  # 人品问题
    '118',  # 牛皮
    '111',  # 江湖小虾
    '106',  # 人间天堂
    '120',  # 泥菩萨
    '102',  # 纶巾羽扇
    '104',  # 陆军上校
    '115',  # 安眠药
    '112',  # 柠檬水
    '114',  # 蓝墨水
    '101',  # 鸟尽弓藏
    '109',  # 入门三分
    '108',  # 拓海
    '113',  # 阿明
    '110',  # 百城
    '119',  # 怕出名
    '116',  # 两秒
    '105',  # 刘佳
    '103',  # 良家女子
]

user_ids_xyft = [
    # 幸运飞艇
    '257',  # 风凉话
    '259',  # 活雷锋
    '242',  # 独奏
    '256',  # 花里胡哨
    '252',  # 海浪
    '251',  # 猴年马月
    '250',  # 哈啰
    '241',  # 豪情壮志
    '243',  # 大赚一票
    '248',  # 华人
    '255',  # 伏尔甘
    '249',  # 父老乡亲
    '260',  # 一夜春风
    '244',  # 刀俎
    '246',  # 后来者
    '258',  # 鹤立鸡群
    '253',  # 黑暗之刃
    '245',  # 独走江湖
    '247',  # 画龙点睛
    '254',  # 葫芦
]

user_ids = [
    # SG飞艇
    '143',  # 骆驼瘦死
    '144',  # 霸主
    '160',  # 瞭望哨
    '142',  # 人上有人
    '152',  # 国王陛下
    '150',  # 力图自强
    '149',  # 雷霆
    '148',  # 龙头老大
    '151',  # 老藤
    '154',  # 人为财死
    '157',  # 势如破竹
    '158',  # 零位
    '147',  # 胜者
    '155',  # 任我行
    '159',  # 爱我所爱
    '153',  # 蝼蚁
    '156',  # 力挽狂澜
    '145',  # 钟馗
    '146',  # 夜空
    '141',  # 梁书文

    # 北京PK10
    '18',   # 能人
    '9',    # 烂泥
    '13',   # 日理万机
    '1',    # 断水流
    '15',   # 如你所愿
    '4',    # 令人满意
    '7',    # 阿鲁提亚
    '8',    # 了如指掌
    '17',   # 柳暗花明
    '12',   # 陆离
    '2',    # 能耐我何
    '5',    # 恶狼传说
    '19',   # 老农
    '14',   # 难能可贵
    '11',   # 一个老人
    '20',   # 念念不忘
    '3',    # 老老实实
    '10',   # 阿牛哥
    '6',    # 老娘
    '16',   # 爱理不理

    # 急速赛车
    '134',  # 鹿死我手
    '138',  # 络腮胡
    '129',  # 龙三
    '124',  # 刘沁
    '136',  # 料事如神
    '121',  # 牛脾气
    '133',  # 逆时针
    '131',  # 屡试不爽
    '126',  # 宁缺
    '128',  # 能掐会算
    '123',  # 鸟枪换炮
    '139',  # 蓝舌
    '122',  # 略胜一筹
    '127',  # 老前辈
    '140',  # 罗斯
    '137',  # 睨视
    '132',  # 人上人
    '130',  # 连胜
    '125',  # 人穷志短

    # 澳洲幸运10
    '49',   # 认不出
    '55',   # 爱财如命
    '46',   # 吕不韦
    '58',   # 任重道远
    '42',   # 难不倒
    '57',   # 良辰吉日
    '43',   # 蜡笔小新
    '54',   # 屡战屡败
    '47',   # 刘伯温
    '48',   # 奥布莱恩
    '51',   # 陆冰
    '44',   # 耳边风
    '60',   # 落尘
    '41',   # 惹不起
    '50',   # 鲁班
    '56',   # 老粗
    '53',   # 力薄才疏
    '59',   # 嫩草
    '45',   # 老表
    '52',   # 肉白骨

    # 急速飞艇
    '107',  # 扭亏为盈
    '117',  # 人品问题
    '118',  # 牛皮
    '111',  # 江湖小虾
    '106',  # 人间天堂
    '120',  # 泥菩萨
    '102',  # 纶巾羽扇
    '104',  # 陆军上校
    '115',  # 安眠药
    '112',  # 柠檬水
    '114',  # 蓝墨水
    '101',  # 鸟尽弓藏
    '109',  # 入门三分
    '108',  # 拓海
    '113',  # 阿明
    '110',  # 百城
    '119',  # 怕出名
    '116',  # 两秒
    '105',  # 刘佳
    '103',  # 良家女子

    # 幸运飞艇
    '257',  # 风凉话
    '259',  # 活雷锋
    '242',  # 独奏
    '256',  # 花里胡哨
    '252',  # 海浪
    '251',  # 猴年马月
    '250',  # 哈啰
    '241',  # 豪情壮志
    '243',  # 大赚一票
    '248',  # 华人
    '255',  # 伏尔甘
    '249',  # 父老乡亲
    '260',  # 一夜春风
    '244',  # 刀俎
    '246',  # 后来者
    '258',  # 鹤立鸡群
    '253',  # 黑暗之刃
    '245',  # 独走江湖
    '247',  # 画龙点睛
    '254',  # 葫芦
]

user_ids_cq_klsx = [
    # 重庆欢乐生肖
    '31',   # 热辣
    '23',   # 逆耳
    '40',   # 临兵斗者
    '22',   # 老衲
    '25',   # 令人费解
    '30',   # 雷厉风行
    '38',   # 雷利
    '34',   # 女流之辈
    '35',   # 冷冷清清
    '28',   # 蓝领阶层
    '29',   # 流年似水
    '36',   # 努尔哈赤
    '26',   # 流浪汉
    '27',   # 女流氓
    '21',   # 如日中天
    '32',   # 阿尔卑斯
    '37',   # 男人婆
    '39',   # 内部资料
    '24',   # 女猎人
    '33',   # 了然
]

user_ids_js_ssc = [
    # 急速时时彩
    '238',  # 书虫子
    '204',  # 首长
    '222',  # 一人得道
    '229',  # 势必能
    '226',  # 总舵主
    '236',  # 神出鬼没
    '225',  # 小钢炮
    '228',  # 再创新高
    '233',  # 三朝元老
    '239',  # 泣鬼神
    '223',  # 智多星
    '230',  # 受宠若惊
    '227',  # 战场老将
    '232',  # 说曹操
    '235',  # 上上签
    '231',  # 收场
    '237',  # 搜肠刮肚
    '224',  # 宝刀未老
    '221',  # 卡卡西
    '234',  # 深藏不露
]

user_ids_xy_ssc = [
    # 幸运时时彩
    '177',  # 不败之地
    '168',  # 人心不古
    '163',  # 那些人
    '174',  # 老友
    '170',  # 刘项
    '172',  # 良心话
    '165',  # 翱翔
    '166',  # 暗香
    '180',  # 荣膺
    '178',  # 良药
    '175',  # 老用户
    '162',  # 热心人
    '173',  # 另一人
    '167',  # 两袖清风
    '161',  # 胡八一
    '179',  # 如鱼得水
    '176',  # 得意
    '169',  # 阿修罗
    '171',  # 内行人
    '164',  # 老兄弟
]

user_ids_tj_ssc = [
    # 天津时时彩
    '77',   # 荣华富贵
    '75',   # 零花钱
    '76',   # 乐呵呵
    '71',   # 零度以上
    '79',   # 李海浪
    '63',   # 领唱者
    '68',   # 浪得虚名
    '64',   # 熬出头
    '69',   # 牛刀
    '66',   # 牛犊子
    '62',   # 暗藏玄机
    '67',   # 大师兄
    '80',   # 老和尚
    '61',   # 如痴如狂
    '65',   # 二当家
    '72',   # 荣登王座
    '73',   # 爱好者
    '74',   # 难逢敌手
    '70',   # 老干娘
    '78',   # 流芳百世
]

user_ids_xj_ssc = [
    # 新疆时时彩
    '93',   # 如假包换
    '99',   # 儒将
    '96',   # 二进宫
    '87',   # 利滚利
    '92',   # 牢记于心
    '89',   # 老外
    '85',   # 恩公
    '83',   # 烂好人
    '97',   # 冷峻
    '82',   # 暗号
    '88',   # 流光
    '81',   # 龙虎乱舞
    '100',  # 浪迹天涯
    '90',   # 李国强
    '94',   # 宁静致远
    '98',   # 老骥伏枥
    '91',   # 鲁恭王
    '95',   # 匿迹
    '84',   # 灵魂深处
    '86',   # 爱国者
]

user_ids_az_xy5 = [
    # 澳洲幸运5
    '199',  # 二姨妈
    '193',  # 神罗天征
    '195',  # 留一手
    '186',  # 天意
    '197',  # 蝼蚁得志
    '184',  # 路遥
    '189',  # 小生
    '190',  # 肉眼凡夫
    '196',  # 流言飞语
    '192',  # 李翊君
    '187',  # 冠军
    '181',  # 冷眼旁观
    '200',  # 老严
    '185',  # 绿叶成荫
    '183',  # 老幺
    '194',  # 卡卡罗特
    '182',  # 老鸦
    '198',  # 绿衣使者
    '188',  # 清风
    '191',  # 仁义之师
]

user_ids_tw5 = [
    # 台湾5分
    '210',  # 马风
    '213',  # 醉爱茅台
    '220',  # 指环王
    '202',  # 捉摸不定
    '204',  # 醉客
    '219',  # 陆道友
    '214',  # 正规军
    '201',  # 总督
    '218',  # 造化小儿
    '206',  # 中举
    '208',  # 直谏
    '205',  # 抓阄儿
    '203',  # 参谋长
    '212',  # 走江湖
    '209',  # 张大仙
    '215',  # 七雄
    '207',  # 总教官
    '216',  # 账房先生
    '211',  # 先挣一亿
    '217',  # 征服者
]

# 0定码 1杀码 2大小 3单双 4龙虎
expert_recommendation_type = [0, 1, 2, 3, 4]

# 1pk拾系列 2时时彩系列
# group_code = ['1', '2']

# 0冠亚和 1冠军 2亚军 3第三名 4第四名 5第五名 6第六名 7第七名 8第八名 9第九名 10第十名
# 当ranking=0时，type=2或3
ranking_list_pk10 = ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10']

# 0总和 1万位 2千位 3百位 4十位 5个位 6龙虎和
# 当ranking=0时，type=2或3
# 当ranking=6时, type=0
ranking_list_ssc = ['0', '1', '2', '3', '4', '5', '6']

# pk10系列
lot_code_pk10 = {
    '10058': '5005',    # SG飞艇
    '10001': '5001',      # 北京PK10
    '10037': '1001',      # 极速赛车
    '10012': '3003',      # 澳洲幸运10
    '10035': '1003',      # 极速飞艇
    '10057': '5004',      # 幸运飞艇
}

# 时时彩系列
lot_code_ssc = {
    '10060': '5002',      # 重庆欢乐生肖
    '10036': '1002',      # 急速时时彩
    '10059': '5003',      # 幸运时时彩
    '10003': '5008',      # 天津时时彩
    '10004': '5009',      # 新疆时时彩
    '10010': '3001',      # 澳洲幸运5
    '10064': '5007'       # 台湾5分彩票
}
